Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/social_welfare_payments/unemployed_people/preta.html.txt.tmx
Source language: en
Languages: ga

source: The Pre-Retirement Allowance (PRETA) is for people in Ireland aged 55 and over who have left the labour force
ga: Tá Liúntas Réamhscoir ar fáil do dhaoine atá 55 bliain agus ós a chionn go bhfuil an fórsa saothair fágtha acu

source: It is means-tested and you no longer have to sign-on as you do not need to be available for work
ga: Tá scrúdú maoine ann agus ní bheidh ort síniú chun fostaíochta níos mó mar ní gá duit a bheith ar fáil chun oibre

source: However, if you were getting Pre-Retirement Allowance before 4 July 2007 you are not affected and can continue to get it
ga: Ní ghlacfar le haon iarratas nua le haghaidh Liúntas Réamhscoir ó 4 Iúil 2007 ar aghaidh

source: In order to qualify, you must:
ga: Le bheith intofa, caithfidh tú

source: (a) Be aged between 55 and 66
ga: (a) bheith idir 55 agus 66 bliain

source: • have been getting Jobseeker's Benefit or Jobseeker's Allowance for 15 months or,
ga: • Bheith ag fáil Sochar Cuardaitheora Poist nó Liúntas Cuardaitheora Poist ar feadh 15 mí nó

source: • are no longer getting One-Parent Family Payment or Carer's Allowance or,
ga: • Stopadh a bheith i dteideal Íocaíocht Teaghlaigh Aontuismitheora, nó Liúntas Cúntora nó

source: • be a separated spouse who has not been working in the previous 15 months
ga: • Bheith i do chéile scortha nach raibh ag obair le 15 mí

source: (e) Pass a means test
ga: (d) scrúdú maoine a shásamh

source: (The means test is similar to the means test for Jobseeker's Allowance)
ga: tá an scrúdú maoine mar an gceanna leis an scrúdú maoine do Liúntas Cuardaitheora Poist

source: Working while on Pre-Retirement Allowance
ga: Ag obair agus Liúntas Réamhscoir á fháil

source: However, there are exceptions, if you are getting PRETA for 12 months or longer you are eligible for either the Back to Work Allowance or Back to Work Enterprise Allowance scheme
ga: Má bhí Liúntas Réamhscoir á fháil agat ar feadh tréimhse 12 mhí nó níos faide tá tú incháilithe le haghaidh ceachtar de na scéimeanna seo Liúntas um Fhilleadh ar Obair nó Liúntas Fiontraíochta um Fhilleadh ar Obair

source: Smallholders (farmers) may earn money from their holding and get PRETA, provided they pass the means test
ga: Féadfaidh sealbhóirí beaga airgead a thuilleamh óna ngabháltais agus féadfaidh siad Liúntas Réamhscoir a fháil má shásaíonn siad an tástáil mhaoine

source: You do not have to sign on if you are getting PRETA
ga: Má tá tú ag fáil Pinsean Réamhscortha ní gá duit a bheith ar fáil chun oibre agus ní gá duit síniú chun fostaíochta

source: PRETA maximum weekly rates from 8 March 2017
ga: Ráta Seachtainiúil ó 8 Márta 2017

source: │Qualified adult │€128.10 │
ga: │Duine fásta Cáilithe │€128.10 │

source: │Qualified child │€29.80 │
ga: │Páiste Cáilithe │€29.80 │

source: Since 4 July 2007, no new applications for Pre-Retirement Allowance are accepted
ga: Ó 4 Iúil 2007, ní bheidh aon iarratas nua ar Liúntas Réamh-Scoir glactha

source: The Social Welfare Reform and Pensions Act 2006 abolishes the Pre-Retirement Allowance but existing recipients are not affected and may continue to get it
ga: Chuir an t-Acht um Athchóiriú an Dlí Leasa Shóisialaigh agus um Pinsin 2006 deireadh leis an Liúntas Réamh-Scoir. Níl aon difear déanta do faighteoirí reatha agus leanfaidh siad an íocaíocht a fháil
